Src/OpenFOAM/OpenFOAM-5.x-master/tutorials/multiphase/compressibleInterDyMFoam/RAS/sloshingTank2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 system/blockMeshDict.m4 > system/blockMeshDict
runApplication blockMesh
cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication `getApplication`

#------------------------------------------------------------------------------
